%pyspark

ebm_dd_rto_v2 = spark.read \
    .format('0000000') \
    .option("000000000","0000000://0000000000000000000000000000000000000000000") \
    .option("000000000000","000000000000") \
    .option("000000000","0000000") \
    .option("0000000000","0000000") \
    .option("query","""

    SELECT N2.STR_NM
         , N3.CMPGN_ST_DT
         , N3.CMPGN_END_DT
         , N1.DT
         , N1.CMPGN_ID
         , N1.CMPGN_NM
         , N1.CGRP_ID
         , N1.CGRP_NM
         , N1.PG_CNT
         , N1.PG_SND_Y_CNT
         , N1.PG_PCH_CNT
         , N1.PG_SUM_PCH
         , N1.CG_CNT
         , N1.CG_PCH_CNT
         , N1.CG_SUM_PCH
    FROM (
        SELECT T1.RGST_STR_CD AS CSTR_CD
             , TO_CHAR(DTCT_DTM, 'YYYY-MM-DD') AS DT
             , T1.CMPGN_ID
             , T1.CGRP_ID
             , COUNT(DISTINCT CASE WHEN T1.CGRP_CL_CD IN ('T') THEN T1.DPSTR_CUST_NO END)                                                                                                                                                                AS PG_CNT
             , COUNT(DISTINCT CASE WHEN T1.CGRP_CL_CD IN ('T') AND CHNL_SND_SCES_YN IN ('Y') THEN T1.DPSTR_CUST_NO END)                                                                                                                                  AS PG_SND_Y_CNT
             , COUNT(DISTINCT CASE WHEN T1.CGRP_CL_CD IN ('T') AND CHNL_SND_SCES_YN IN ('Y') AND TO_CHAR(T1.DTCT_DTM, 'YYYYMMDD') = TO_CHAR(T1.SLNG_DTM, 'YYYYMMDD') AND T1.PCH_AMT > 0 AND T1.DTCT_DTM < T1.SLNG_DTM THEN T1.DPSTR_CUST_NO2 END)        AS PG_PCH_CNT
             , SUM(CASE WHEN T1.CGRP_CL_CD IN ('T') AND CHNL_SND_SCES_YN IN ('Y') AND TO_CHAR(t1.DTCT_DTM, 'YYYYMMDD') = TO_CHAR(T1.SLNG_DTM, 'YYYYMMDD') AND T1.PCH_AMT > 0 AND T1.DTCT_DTM < T1.SLNG_DTM THEN T1.PCH_AMT END)                          AS PG_SUM_PCH
             , COUNT(DISTINCT CASE WHEN T1.CGRP_CL_CD IN ('C') THEN T1.DPSTR_CUST_NO END)                                                                                                                                                                AS CG_CNT
             , COUNT(DISTINCT CASE WHEN T1.CGRP_CL_CD IN ('C') AND TO_CHAR(t1.DTCT_DTM, 'YYYYMMDD') = TO_CHAR(T1.SLNG_DTM, 'YYYYMMDD') AND T1.PCH_AMT > 0 AND T1.DTCT_DTM < T1.SLNG_DTM  THEN T1.DPSTR_CUST_NO2 END)                                     AS CG_PCH_CNT
             , SUM(CASE WHEN T1.CGRP_CL_CD IN ('C') AND TO_CHAR(t1.DTCT_DTM, 'YYYYMMDD') = TO_CHAR(T1.SLNG_DTM, 'YYYYMMDD') AND T1.PCH_AMT > 0 AND T1.DTCT_DTM < T1.SLNG_DTM THEN T1.PCH_AMT END)                                                        AS CG_SUM_PCH
        FROM (
            select A11.RGST_STR_CD
                 , A11.CMPGN_ID
                 , A11.CGRP_ID
                 , A11.CGRP_CL_CD
                 , A11.DPSTR_CUST_NO
                 , A11.DTCT_DTM
                 , A12.DPSTR_CUST_NO AS DPSTR_CUST_NO2
                 , A11.CHNL_SND_SCES_YN
                 , A12.PCH_AMT
                 , A12.SLNG_DTM
            from lpciddm.tb_dmcm_ebmcmpgnobjcustdtl_i a11
            left join lpciddm.tb_dmcm_ebmcmpgndtlpchresp_f a12
                on a11.cmpgn_id = a12.cmpgn_id
                and a11.cgrp_id = a12.cgrp_id
                and a11.cgrp_cl_cd = a12.cgrp_cl_cd
                and a11.dpstr_cust_no = a12.dpstr_cust_no
                AND A11.RGST_STR_CD = A12.CSTR_CD
            where 1 = 1 
                and a11.cgrp_cl_cd in ('T', 'C')
                and a11.std_ym in ('202106', '202107')
            ) T1 
        WHERE 1 = 1 
            AND T1.RGST_STR_CD <> '0000'
            AND TO_CHAR(DTCT_DTM, 'YYYY-MM-DD') BETWEEN '2021-06-01' AND '2021-07-31'
        GROUP BY T1.RGST_STR_CD
               , TO_CHAR(DTCT_DTM, 'YYYY-MM-DD')
               , T1.CMPGN_ID
               , T1.CGRP_ID
        ORDER BY 1,2,3,4
        ) N1
    JOIN LPCIDDW.TB_DWBS_STR_M N2 
        ON N1.CSTR_CD = N2.CSTR_CD
    JOIN LPCIDDW.TB_DWCM_EBMCMPGN_L N3
        ON N1.CMPGN_ID = N3.CMPGN_ID
    JOIN LPCIDDW.TB_DWCM_EBMCGRP_L N4 
        ON N1.CGRP_ID = N4.CGRP_ID
        AND N1.CMPGN_ID = N4.CMPGN_ID
    WHERE 1 = 1 
--        AND N3.CMPGN_NM LIKE '%내점고객%'
    ORDER BY N1.CSTR_CD, DT, N1.CMPGN_ID, N1.CGRP_ID
     """).load()

ebm_dd_rto_v2.createOrReplaceTempView("ebm_dd_rto_v2")
ebm_dd_rto_v2.show(1000)

+--------+-----------+------------+----------+--------+---------------------------+----------------+--------------------------------+------+------------+----------+----------+------+----------+----------+
|  str_nm|cmpgn_st_dt|cmpgn_end_dt|        dt|cmpgn_id|                   cmpgn_nm|         cgrp_id|                         cgrp_nm|pg_cnt|pg_snd_y_cnt|pg_pch_cnt|pg_sum_pch|cg_cnt|cg_pch_cnt|cg_sum_pch|
+--------+-----------+------------+----------+--------+---------------------------+----------------+--------------------------------+------+------------+----------+----------+------+----------+----------+
|    본점| 2021-07-01|  2021-07-04|2021-07-01|C0105113|20210701_자동화캠페인_안...|ND20210701183657|                   영플라자 안내|    63|          61|        16|   3019430|     0|         0|      null|
|    본점| 2021-07-01|  2021-07-04|2021-07-02|C0105113|20210701_자동화캠페인_안...|ND20210701183657|                   영플라자 안내|   136|         127|        51|  19432000|     0|         0|      null|
|    본점| 2021-07-01|  2021-07-04|2021-07-03|C0105113|20210701_자동화캠페인_안...|ND20210701183657|                   영플라자 안내|   133|         127|        52|  17867160|     0|         0|      null|
|    본점| 2021-07-01|  2021-07-04|2021-07-04|C0105113|20210701_자동화캠페인_안...|ND20210701183657|                   영플라자 안내|    96|          95|        28|  31774960|     0|         0|      null|
|  잠실점| 2021-06-04|  2021-06-30|2021-06-04|C0099752| [자동화캠페인] 20210603...|ND10130603180243|     백_내점고객 Upsell_유도_...|   379|         373|       125|  29603960|    40|        22|   2762800|
|  잠실점| 2021-06-04|  2021-06-30|2021-06-04|C0099752| [자동화캠페인] 20210603...|ND10140603180244|     백_내점고객 Upsell_유도_...|   113|         112|        32|  18743470|    17|         8|   2177400|
|  잠실점| 2021-06-04|  2021-06-30|2021-06-04|C0099752| [자동화캠페인] 20210603...|ND10150603180245|     백_내점고객 Upsell_유도_...|   263|         259|        73|  48002980|    36|        12|   1796380|
|  잠실점| 2021-06-04|  2021-06-30|2021-06-04|C0099752| [자동화캠페인] 20210603...|ND10160603180259|     백_내점고객 Upsell_유도_...|  1489|        1463|       383| 237145950|   158|        41|  22516920|
|  잠실점| 2021-06-04|  2021-06-30|2021-06-04|C0099752| [자동화캠페인] 20210603...|ND20210526141649|     백_내점고객 Upsell_유도_...|  2625|        2600|      1031| 672608400|   293|       115|  30733220|
|  잠실점| 2021-06-15|  2021-06-17|2021-06-15|C0101600| 20210612_자동화캠페인 |...|ND20210612183021|                   카드 결제고객|  1098|        1081|        20|  16525400|     0|         0|      null|
|  잠실점| 2021-06-15|  2021-06-17|2021-06-16|C0101600| 20210612_자동화캠페인 |...|ND20210612183021|                   카드 결제고객|  1027|        1007|        16|  10719380|     0|         0|      null|
|  잠실점| 2021-06-15|  2021-06-17|2021-06-17|C0101600| 20210612_자동화캠페인 |...|ND20210612183021|                   카드 결제고객|  1076|        1050|        10|  15664500|     0|         0|      null|
|  잠실점| 2021-06-25|  2021-06-29|2021-06-25|C0103820| 20210624_자동화캠페인 |...|ND20210624172040|       행사기간 중 카드 결제고객|  1525|        1479|        54| 131239860|     0|         0|      null|
|  잠실점| 2021-06-25|  2021-06-29|2021-06-26|C0103820| 20210624_자동화캠페인 |...|ND20210624172040|       행사기간 중 카드 결제고객|  1466|        1415|        37|  80282790|     0|         0|      null|
|  잠실점| 2021-06-25|  2021-06-29|2021-06-27|C0103820| 20210624_자동화캠페인 |...|ND20210624172040|       행사기간 중 카드 결제고객|  1358|        1302|        38|  64327350|     0|         0|      null|
|  잠실점| 2021-06-28|  2021-06-29|2021-06-28|C0103832| 20210624_자동화캠페인 |...|ND20210624174557|       행사기간 중 카드결제 고객|  1168|        1136|        17|  19833450|     0|         0|      null|
|  잠실점| 2021-06-28|  2021-06-29|2021-06-29|C0103832| 20210624_자동화캠페인 |...|ND20210624174557|       행사기간 중 카드결제 고객|  1338|        1285|        25|  26464240|     0|         0|      null|
|  잠실점| 2021-07-01|  2021-07-31|2021-07-01|C0104307| 20210628_자동화캠페인_​...|ND10220629163929|      백_내점고객 Upsell_유도...|   275|         269|        79|  18333350|    66|        21|   1340500|
|  잠실점| 2021-07-01|  2021-07-31|2021-07-01|C0104307| 20210628_자동화캠페인_​...|ND10230629163935|      백_내점고객 Upsell_유도...|   476|         470|       121|  22265250|   103|        31|   3676820|
|  잠실점| 2021-07-01|  2021-07-31|2021-07-01|C0104307| 20210628_자동화캠페인_​...|ND10240629164132|      백_내점고객 Upsell_유도...|   141|         141|        53|  49102140|    26|         5|    305180|
|  잠실점| 2021-07-01|  2021-07-31|2021-07-01|C0104307| 20210628_자동화캠페인_​...|ND10250629164225|      백_내점고객 Upsell_유도...|  1596|        1578|       425|  93834740|   340|        80|  16368500|
|  잠실점| 2021-07-01|  2021-07-31|2021-07-01|C0104307| 20210628_자동화캠페인_​...|ND20210625154205|      백_내점고객 Upsell_유도...|  2512|        2481|       984| 425193740|   534|       209|  63046820|
|  잠실점| 2021-07-01|  2021-07-31|2021-07-02|C0104307| 20210628_자동화캠페인_​...|ND10220629163929|      백_내점고객 Upsell_유도...|    91|          86|        25|   6048680|    16|         4|    656050|
|  잠실점| 2021-07-01|  2021-07-31|2021-07-02|C0104307| 20210628_자동화캠페인_​...|ND10230629163935|      백_내점고객 Upsell_유도...|   223|         221|        73|  48410570|    40|        10|   2243860|
|  잠실점| 2021-07-01|  2021-07-31|2021-07-02|C0104307| 20210628_자동화캠페인_​...|ND10240629164132|      백_내점고객 Upsell_유도...|    71|          71|        25|  11930280|    10|         4|    867020|
|  잠실점| 2021-07-01|  2021-07-31|2021-07-02|C0104307| 20210628_자동화캠페인_​...|ND10250629164225|      백_내점고객 Upsell_유도...|   745|         734|       231|  94743430|   187|        51|   8381800|
|  잠실점| 2021-07-01|  2021-07-31|2021-07-02|C0104307| 20210628_자동화캠페인_​...|ND20210625154205|      백_내점고객 Upsell_유도...|  1500|        1489|       588| 462825690|   309|       133|  84650410|
|  잠실점| 2021-07-05|  2021-07-08|2021-07-05|C0105340| 20210703_자동화캠페인 |...|ND20210703115207|                   카드결제 고객|  1262|        1211|        17|  11906760|     0|         0|      null|
|  잠실점| 2021-07-05|  2021-07-08|2021-07-06|C0105340| 20210703_자동화캠페인 |...|ND20210703115207|                   카드결제 고객|  1380|        1332|        27|  28005720|     0|         0|      null|
|  잠실점| 2021-07-06|  2021-07-31|2021-07-06|C0105620| 20210705_자동화캠페인| ...|ND10260705181911|      백_내점고객 Upsell_유도...|   199|         193|        49|   9797510|    45|         9|    939500|
|  잠실점| 2021-07-06|  2021-07-31|2021-07-06|C0105620| 20210705_자동화캠페인| ...|ND10270705181916|      백_내점고객 Upsell_유도...|   443|         434|       134|  21543100|    83|        24|   2690660|
|  잠실점| 2021-07-06|  2021-07-31|2021-07-06|C0105620| 20210705_자동화캠페인| ...|ND10280705181924|      백_내점고객 Upsell_유도...|   117|         115|        39|   6791500|    23|         8|    754200|
|  잠실점| 2021-07-06|  2021-07-31|2021-07-06|C0105620| 20210705_자동화캠페인| ...|ND10290705181932|      백_내점고객 Upsell_유도...|  1400|        1379|       410|  67291660|   263|        66|   7692160|
|  잠실점| 2021-07-06|  2021-07-31|2021-07-06|C0105620| 20210705_자동화캠페인| ...|ND20210625154205|      백_내점고객 Upsell_유도...|  2210|        2178|       823| 211943870|   329|       122|  21519210|
|  잠실점| 2021-07-05|  2021-07-08|2021-07-07|C0105340| 20210703_자동화캠페인 |...|ND20210703115207|                   카드결제 고객|  1247|        1185|        22|  27974100|     0|         0|      null|
